tap "agrinman/tap"
tap "bloznelis/tap"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "yt-dlp/taps"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# GNU multiple precision arithmetic library
brew "gmp"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Image processing and image analysis library
brew "leptonica"
# C library for files containing sampled sound
brew "libsndfile"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Manage Procfile-based applications
brew "foreman"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GIF image/animation creator/editor
brew "gifsicle"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# YAML Parser
brew "libyaml"
# Language Server for the Lua language
brew "lua-language-server"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line Git information tool
brew "onefetch"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", restart_service: :changed, link: true
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Simple terminal UI for search and replace
brew "serpl"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command driven spotify player
brew "spotify_player"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Expose your local web server to the internet with a public url: https://tunnelto.dev
brew "agrinman/tap/tunnelto"
# Minimal, terminal based typing speed tester
brew "bloznelis/tap/typioca"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
vscode "aliariff.vscode-erb-beautify"
vscode "augment.vscode-augment"
vscode "biomejs.biome"
vscode "castwide.ruby-debug"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "jdinhlife.gruvbox"
vscode "kaiwood.endwise"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
